#include "stdafx.h"
#include "DefaultAllocator.h"
//-----------------------------------------------------------------------------
// TODO: возможно избавиться от глобальной переменной
//-----------------------------------------------------------------------------
DefaultAllocator gDefaultAllocator;
//-----------------------------------------------------------------------------
DefaultAllocator& GetAllocator()
{
	return gDefaultAllocator;
}
//-----------------------------------------------------------------------------